#+title: Session Exercises

*** Issue 0 - If Code-Block error

#+begin_src C++
#include <iostream>

// does absolute value
int main() {
    int value = 0;

    if (!(std::cin >> value))
    {
        std::cout << "Exiting... Input must be an integer.";
        return 0;
    }

    // store a copy of the initial value, for printing later.
    int initialValue = value;

    if (value < 0)
        value *= -1;
        std::cout << "" << '\n';
    else
        std::cout << "Input is already positive." << '\n';

    std::cout << "| " << initialValue << "| is " << value << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: Exiting... Input must be an integer.

*** Issue 2.1 - Chaining [not the same?] conditionals

exact same program as the last.
completely valid code, but something is logically very wrong to do.

#+begin_src C++
#include <iostream>

int main() {

    bool condition = false;
    int x = 7;

    if (condition)
        std::cout << "Condition is TRUE!" << '\n';
    else if (x > 5)
        std::cout << "Condition is FALSE and x is > than 5." << '\n';
    else
        std::cout << "Conditiion is FALSE and x is less than, or equal to, 5." << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: Condition is FALSE and x is > than 5.

*** Challenge 0 - if to switch

Don't worry about checking the uppercase condition for this exercise.

#+begin_src C++
#include <iostream>

int main() {

    char selection = 'a';

    if (selection == 'a')
        std::cout << "You selected A." << '\n';
    else if (selection == 'b')
        std::cout << "You selected B." << '\n';
    else if (selection == 'c')
        std::cout << "You selected C." << '\n';
    else if (selection == 'd')
        std::cout << "You selected D." << '\n';
    else if (selection == 'e')
        std::cout << "You selected E." << '\n';
    else
        std::cout << "Not a valid selection." << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: You selected A.

*** Challenge 1 - switch to if

don't manually check if the stuff in the (parens) is also true also, do that with the structure.
ie. checking lower bounds first.

#+begin_src C++
#include <iostream>

int main() {

    char value = 0;

    switch (value)
    {
        case 0:
        case 1:
        case 2:
        case 3:
        case 4:
            std::cout << "Value is less than 5 (Not negative)." << '\n';
            break;
        case 5:
        case 6:
        case 7:
        case 8:
        case 9:
            std::cout << "Value is less than 9 (but > 4)." << '\n';
            break;
        case 10:
        case 11:
        case 12:
        case 13:
        case 14:
            std::cout << "Value is less than 15 (but > 9)." << '\n';
            break;
        case 15:
        case 16:
        case 17:
        case 18:
        case 19:
            std::cout << "Value is less than 20 (but > 14)." << '\n';
            break;
        default:
            std::cout << "Value not valid." << '\n';
            break;

    };

    return 0;
}
#+end_src

#+RESULTS:
: Value is less than 5 (but not negative).

*** Challenge 2 - Print every case if it matches

Like in our last example, use a switch statement to print if a value is less than a maximum.

except make it so that if prints every limit it is below.

use the max limit of 20, and do 5 step increments.

- ie. if the number is 19, print:
  Value is less than 20.
- ie. if the number is 14, print:
  Value is less than 15.
  Value is less than 20.
- ie. if the number is 0, print:
  Value is less than 5.
  Value is less than 10.
  Value is less than 15.
  Value is less than 20.

the output code won't be far too different than the original switch code of the last example.

It's not the most useful example, but it will give you a more intuitive sense of switch statements, and help to avoid ome of the logical errors many people make with them.

=question after= how would we go about printing those values in reverse (proper) order?

#+begin_src C++
#include <iostream>

int main() {

    char value = 0;

    switch (value)
    {
        case 0:
        case 1:
        case 2:
        case 3:
        case 4:
            std::cout << "Value is less than 5." << '\n';
        case 5:
        case 6:
        case 7:
        case 8:
        case 9:
            std::cout << "Value is less than 9." << '\n';
        case 10:
        case 11:
        case 12:
        case 13:
        case 14:
            std::cout << "Value is less than 15." << '\n';
        case 15:
        case 16:
        case 17:
        case 18:
        case 19:
            std::cout << "Value is less than 20." << '\n';
            break;
        default:
            std::cout << "Value not valid." << '\n';
            break;

    };

    return 0;
}
#+end_src

#+RESULTS:
| Value | is | less | than |  5 |
| Value | is | less | than |  9 |
| Value | is | less | than | 15 |
| Value | is | less | than | 20 |

** Questions

when does an for loop execute its terms
1. initializer / loop variant
2. condition
3. updater

when will i be updated
#+begin_src c++
for (int i = 0; i < 10; ++i)
{
    // do something
}
#+end_src

value++
++value

value--
--value

can we eliminate certain terms from our for loop?

what happens if we eliminate all the terms within a for loop?

given the following program, what is going to happen?
#+begin_src C++
#include <iostream>

// loop ten times
int main()
{
    for (;;)
    {
        std::cout << "Running" << '\n';
    }

    return 0;
}
#+end_src
what would be an equivalent statement with while loop instead of a for?

why would you want a for loop over a while loop?
- what happens with the loop variant in the for loop, vs a while loop?
why would you want a while loop over a for loop?
- what is the best data type to use with while loops?

Why would you want a do while over a while loop?
Why would you want a while over a do while loop?

how many times does a nested for loop execute?
- n*m

what does break do in a loop?

difference between break and return?

what does continue do in a loop?

what is a sentinal?
- a value that indicates the end

what is the result of this statement?
#+begin_src C++ :includes iostream
int a = 3;
int b = 5;
std::cout << (a++ + ++b) * ++a;
#+end_src

#+RESULTS:
: 45

how about this one?
#+begin_src C++ :includes iostream
int a = 3;
int b = 5;
std::cout << (--a + ++b) * a++;
#+end_src

#+RESULTS:
: 16

